Repository: nh36/ChinTransMem
Catalog: corpus/exports/tmx/shijing__all__aligned_passages.tmx
Source language: zh_hant
Languages: en

source: 鳧鷖在涇，公尸來燕來寧。爾酒既清，爾殽既馨。公尸燕飲，福祿來成。
en: The wild-ducks and widgeons are on the King; ​The personators of your ancestors feast and are happy. Your spirits are clear; Your viands are fragrant. The personators of your ancestors feast and drink;— Their happiness and dignity are made complete.

source: 鳧鷖在沙，公尸來燕來宜。爾酒既多，爾殽既嘉。公尸燕飲，福祿來為。
en: The wild-ducks and widgeons are on the sand; The personators of the dead enjoy the feast, their appropriate tribute. Your spirits are abundant; Your viands are good. The personators of your ancestors feast and drink;— Happiness and dignity lend them their aids.

source: 鳧鷖在渚，公尸來燕來處。爾酒既湑，爾殽伊脯。公尸燕飲，福祿來下。
en: The wild-ducks and widgeons are on the islets; The personators of your ancestors feast and enjoy themselves. Your spirits are strained; Your viands are in slices. The personators of your ancestors feast and drink;— Happiness and dignity descend on them.

source: 鳧鷖在潀，公尸來燕來宗。既燕于宗，福祿攸降。公尸燕飲，福祿來崇。
en: The wild-ducks and widgeons are where the waters meet; The personators of your ancestors feast and are honoured. The feast is spread in the ancestral temple. The place where happiness and dignity descend. The personators of your ancestors feast and drink;— Their happiness and dignity are at the highest point.

source: 鳧鷖在亹，公尸來止熏熏。旨酒欣欣，燔炙芬芬。公尸燕飲，無有後艱。
en: The wild-ducks and widgeons are in the gorge; The personators of your ancestors rest, full of complacency. The fine spirits are delicious; Your meat, roast and broiled, is fragrant. The personators of your ancestors feast and drink;— No troubles will be theirs after this.

source: 假樂君子，顯顯令德。宜民宜人，受祿于天。保右命之，自天申之。 干祿百福，子孫千億。穆穆皇皇，宜君宜王。不愆不忘，率由舊章。 威儀抑抑，德音秩秩。無怨無惡，率由羣匹。受福無疆，四方之綱。 之綱之紀，燕及朋友。百辟卿士，媚于天子。不解于位，民之攸塈。
en: Of our admirable, amiable sovereign Most illustrious is the excellent virtue. He orders rightly the people, orders rightly the officers, And receives his dignity from Heaven, Which protects and helps him, and (confirms) his appointment, By repeated acts of renewal from heaven.

source: 有卷者阿，飄風自南。豈弟君子，來游來歌，以矢其音。 伴奐爾游矣，優游爾休矣。豈弟君子，俾爾彌爾性，似先公酋矣。 爾土宇昄章，亦孔之厚矣。豈弟君子，俾爾彌爾性，百神爾主矣。 爾受命長矣，茀祿爾康矣。豈弟君子，俾爾彌爾性，純嘏爾常矣。 有馮有翼，有孝有德，以引以翼。豈弟君子，四方為則。 顒顒卬卬，如圭如璋，令聞令望。豈弟君子，四方為綱。 鳳皇于飛，翽翽其羽，亦集爰止。藹藹王多吉士，維君子使，媚于天子。 鳳皇于飛，翽翽其羽，亦傅于天。藹藹王多吉人，維君子命，媚于庶人。 鳳皇鳴矣，于彼高岡。梧桐生矣，于彼朝陽。菶菶萋萋，雝雝喈喈。 君子之車，既庶且多。君子之馬，既閑且馳。矢詩不多，維以遂歌。
en: Into the recesses of the large mound Came the wind, whirling from the south. There was (our) happy, courteous sovereign, Rambling and singing; And I took occasion to give forth my notes. 'Full of spirits you ramble; Full of satisfaction you rest. O happy and courteous sovereign, May you fulfil your years, And end them like your ancestors!' 'Your territory is great and glorious, And ​perfectly secure. O happy and courteous sovereign, May you fulfil your years, As the host of all the spirits! 'You have received the appointment long acknowledged, With peace around your happiness and dignity. O happy and courteous sovereign, May you fulfil your years, With pure happiness your constant possession! 'You have helpers and supporters, Men of filial piety and of virtue, To lead you on, and act as wings to you, (So that), O happy and courteous sovereign, You are a pattern to the four quarters (of the kingdom). 'Full of dignity and majesty (are they), Like a ​jade-mace (in its purity), The subject of praise, the contemplation of hope. O happy and courteous sovereign, (Through them) the four quarters (of the kingdom) are guided by you. 'The male and female phœnix fly about, Their wings rustling, While they settle in their proper resting-place. Many are your admirable officers, O king, Ready to be employed by you, Loving you, the Son of Heaven. 'The male and female phœnix fly about, Their wings rustling, As they soar up to heaven. Many are your admirable officers, O king, Waiting for your commands, And loving the multitudes of the people. 'The male and female phœnix give out their notes, On that lofty ridge. The dryandras grow, On those eastern slopes. They grow luxuriantly; And harmoniously the notes resound.

source: 民亦勞止，汔可小康。惠此中國，以綏四方。 無縱詭隨，以謹無良。式遏寇虐，憯不畏明。柔遠能邇，以定我王。
en: The people indeed are heavily burdened, But perhaps a little relief may be got for them. Let us cherish this centre of the kingdom, To secure the repose of the four quarters of it. Let us give no indulgence to the wily and obsequious, In order to make the unconscientious careful, And to repress robbers and oppressors, Who have no fear of the clear will (of Heaven). Then let us show kindness to those who are distant, And help those who are near,— Thus establishing (the throne of) our king.

source: 上帝板板，下民卒癉。出話不然，為猶不遠。 靡聖管管，不實於亶。猶之未遠，是用大諫。 天之方難，無然憲憲。天之方蹶，無然泄泄。 辭之輯矣，民之洽矣。辭之懌矣，民之莫矣。 我雖異事，及爾同寮。我即爾謀，聽我嚻嚻。 我言維服，勿以為笑。先民有言，詢于芻蕘。 天之方虐，無然謔謔。老夫灌灌，小子蹻蹻。 匪我言耄，爾用憂謔。多將熇熇，不可救藥。 天之方懠，無為夸毗。威儀卒迷，善人載尸。 民之方殿屎，則莫我敢葵。喪亂蔑資，曾莫惠我師。 天之牖民，如壎如篪。如璋如圭，如取如攜。 攜無曰益，牖民孔易。民之多辟，無自立辟。 价人維藩，大師維垣。大邦維屏，大宗維翰。 懷德維寧，宗子維城。無俾城壞，無獨斯畏。 敬天之怒，無敢戲豫。敬天之渝，無敢馳驅。 昊天曰明，及爾出王。昊天曰旦，及爾游衍。
en: God has reversed (his usual course of procedure), And the lower people are full of distress. The words which you utter are not right; The plans which you form are not far-reaching. As there are not sages, you think you have no guidance;— You have no real sincerity. (Thus) your plans do not reach far, And I therefore strongly admonish you. Heaven is now sending down calamities;— Do not be so complacent. Heaven is now producing such movements;— Do not be so indifferent. If your words were harmonious, The people would become united. If your words were gentle and kind, The people would be settled. Though my duties are different from yours, I am your fellow-servant. I come to advise with you, And you hear me with contemptuous indifference, My words are about the (present urgent) affairs;— Do not think them matter for laughter. The ancients had a saying:— 'Consult the gatherers of grass and firewood.'

source: 蕩蕩上帝，下民之辟。疾威上帝，其命多辟。 天生烝民，其命匪諶。靡不有初，鮮克有終。
en: How vast is God, The ruler of men below! How arrayed in terrors is God, With many things irregular in his ordinations. Heaven gave birth to the multitudes of the people, But the nature it confers is not to be depended on. All are (good) ​at first, But few prove themselves to be so at the last.

source: 文王曰咨！咨女殷商，曾是彊禦，曾是掊克。 曾是在位，曾是在服。天降滔德，女興是力。
en: King Wăn said, 'Alas! Alas! you sovereign of Shang, That you should have such violently oppressive ministers, That you should have such extortionate exactors, That you should have them in offices, That you should have them in the conduct of affairs! "Heaven made them with their insolent dispositions;" But it is you who employ them, and give them strength.'

source: 文王曰咨！咨女殷商，而秉義類，彊禦多懟。 流言以對，寇攘式內。侯作侯祝，靡屆靡究。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Yin-shang, You ought to employ such as are good, But (you employ instead) violent oppressors, who cause many dissatisfactions. They respond to you with baseless stories, And (thus) robbers and thieves are in your court. Hence come oaths and curses, Without limit, without end.'

source: 文王曰咨！咨女殷商，女炰烋于中國，斂怨以為德。 不明爾德，時無背無側。爾德不明，以無陪無卿。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Yin-shang, You show a strong fierce will in the centre of the kingdom, And consider the contracting of enmities a proof of virtue. All-unintelligent are you of your (proper) virtue, And so, you have no (good) men behind you, nor by your side. Without any intelligence of your (proper) virtue, You have no (good) intimate adviser or minister.'

source: 文王曰咨！咨女殷商，天不湎爾以酒，不義從式。 既愆爾止，靡明靡晦；式號式呼，俾晝作夜。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Yin-shang, It is not Heaven that flushes your face with spirits, So that you follow what is evil and imitate it. You go wrong in all your conduct; You make no distinction between the light and the ​darkness; But amid clamour and shouting, You turn the day into night.'

source: 文王曰咨！咨女殷商，如蜩如螗，如沸如羹。 小大近喪，人尚乎由行。內奰于中國，覃及鬼方。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Yin-shang, (All round you) is like the noise of cicadas, Or like the bubbling of boiling soup. Affairs, great and small, are approaching to ruin, And still you (and your creatures) go on in this course. Indignation is rife against you here in the Middle Kingdom, And extends to the demon regions.'

source: 文王曰咨！咨女殷商，匪上帝不時，殷不用舊。 雖無老成人，尚有典刑。曾是莫聽，大命以傾。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Yin-shang, It is not God that has caused this evil time, But it arises from Yin's not using the old (ways). Although you have not old experienced men, There are still the ancient statutes and laws. But you will not listen to them, And so your great appointment is being overthrown.'

source: 文王曰咨！咨女殷商，人亦有言，顛沛之揭。 枝葉未有害，本實先撥。殷鑒不遠，在夏后之世。
en: King Wăn said, 'Alas! Alas! you (sovereign of) Shang, People have a saying, "When a tree falls utterly, While its branches and leaves are yet uninjured, It must first have been uprooted." The beacon of Yin is not far distant;— It is in the age of the (last) sovereign of Hsiâ.'

source: 抑抑威儀，維德之隅。人亦有言，靡哲不愚。 庶人之愚，亦職維疾。哲人之愚，亦維斯戾。 無競維人，四方其訓之。有覺德行，四國順之。 訏謨定命，遠猶辰告。敬慎威儀，維民之則。 其在于今，興迷亂于政。顛覆厥德，荒湛于酒。 女雖湛樂從，弗念厥紹；罔敷求先王，克共明刑。 肆皇天弗尚，如彼泉流，無淪胥以亡。 夙興夜寐，洒埽庭內，維民之章。 脩爾車馬，弓矢戎兵，用戒戎作，用逷蠻方。 質爾人民，謹爾侯度，用戒不虞。 慎爾出話，敬爾威儀，無不柔嘉。 白圭之玷，尚可磨也。斯言之玷，不可為也。 無易由言，無曰苟矣。莫捫朕舌，言不可逝矣。 無言不讎，無德不報。惠于朋友，庶民小子。 子孫繩繩，萬民靡不承。 視爾友君子，輯柔爾顏，不遐有愆。 相在爾室，尚不愧于屋漏。無曰不顯，莫予云覯。 神之格思，不可度思，矧可射思。 辟爾為德，俾臧俾嘉。淑慎爾止，不愆于儀。 不僭不賊，鮮不為則。 投我以桃，報之以李。彼童而角，實虹小子。 荏染柔木，言緡之絲。溫溫恭人，維德之基。 其維哲人，告之話言，順德之行。 其維愚人，覆謂我僭，民各有心。 於乎小子，未知臧否。 匪手攜之，言示之事。匪面命之，言提其耳。 借曰未知，亦既抱子。民之靡盈，誰夙知而莫成。 昊天孔昭，我生靡樂。視爾夢夢，我心慘慘。 誨爾諄諄，聽我藐藐，匪用為教，覆用為虐。 借曰未知，亦聿既耄。 於乎小子，告爾舊止。 聽用我謀，庶無大悔。天方艱難，曰喪厥國。 取譬不遠，昊天不忒。回遹其德，俾民大棘。
en: Outward demeanour, cautious and grave, Is an indication of the (inward) virtue. People have the saying, 'There is no wise man who is not (also) stupid.' The stupidity of the ordinary man Is determined by his (natural) defects. The stupidity of the wise man Is from his doing violence (to his proper character). What is most powerful is the being the man;— ​In all quarters (of the state) men are influenced by it. To an upright virtuous conduct All in the four quarters of the state render obedient homage. With great counsels and determinate orders, With far-reaching plans and timely announcements, And with reverent care of his outward demeanour, One will become the pattern of the people. As for the circumstances of the present time, You are bent on error and confusion in your government. Your virtue is subverted; You are besotted by drink. Although you thus pursue nothing but pleasure, How is it you do not think of your relation to the past, And do not widely study the former kings, That you might hold fast their wise laws? Shall not those whom great Heaven does not approve of, Surely as the waters flow from a spring, Sink down together in ruin? Rise early and go to bed late, Sprinkle and sweep your courtyard;— So as to be a pattern to the people. Have in good order your chariots and horses, Your bows and arrows, and (other) weapons of war;— To be prepared for warlike action, To keep at a distance (the hordes of) the south. Perfect what concerns your officers and people; ​Be careful of your duties as a prince (of the kingdom). To be prepared for unforeseen dangers, Be cautious of what you say; Be reverentially careful of your outward behaviour; In all things be mild and correct. A flaw in a mace of white jade May be ground away; But for a flaw in speech Nothing can be done. Do not speak lightly; your words are your own. Do not say, 'This is of little importance; No one can hold my tongue for me.' Words are not to be cast away. Every word finds its answer; Every good deed has its recompense. If you are gracious among your friends, And to the people, as if they were your children, Your descendants will continue in unbroken line, And all the people will surely be obedient to you. Looked at in friendly intercourse with superior men, You make your countenance harmonious and mild; Anxious not to do anything wrong. Looked at in your chamber, You ought to be equally free from shame before the light which shines in. Do not say, 'This place is not public; No one can see me here.' The approaches of spiritual beings Cannot be calculated beforehand; But the more should they not be slighted.

source: 菀彼桑柔，其下侯旬。捋采其劉，瘼此下民。 不殄心憂，倉兄填兮。倬彼昊天，寧不我矜。
en: Luxuriant is that young mulberry tree, And beneath it wide is the shade; But they will pluck its leaves till it is quite destroyed. The distress ​inflicted on these (multitudes of the) people, Is an unceasing sorrow to my heart; My commiseration fills (my breast). O thou bright and great Heaven, Shouldest thou not have compassion on us?

source: 四牡騤騤，旟旐有翩。亂生不夷，靡國不泯。 民靡有黎，具禍以燼。於乎有哀，國步斯頻。
en: The four steeds (gallop about), eager and strong; The tortoise-and-serpent and the falcon banners fly about. Disorder grows, and no peace can be secured. Every state is being ruined; There are no black heads among the people. Everything is reduced to ashes by calamity. Oh! alas! The doom of the kingdom hurries on.

source: 國步蔑資，天不我將。靡所止疑，云徂何往？ 君子實維，秉心無競。誰生厲階？至今為梗。
en: There is nothing to arrest the doom of the kingdom; Heaven does not nourish us. There is no place in which to stop securely; There is no place to which to go. Superior men are the bonds (of the social state), Allowing no love of strife in their hearts. Who reared the steps of the dissatisfaction, Which has reached the present distress?

source: 憂心慇慇，念我土宇。我生不辰，逢天僤怒。 自西徂東，靡所定處。多我覯痻，孔棘我圉。
en: The grief of my heart is extreme, And I dwell on (the condition of) our land. I was born at an unhappy time, To meet with the severe anger of Heaven. From the west to the east, There is no quiet place of abiding. Many are the distresses I meet with; Very urgent is the trouble on our borders.

source: 天降喪亂，滅我立王。降此蟊賊，稼穡卒痒。 哀恫中國，具贅卒荒。靡有旅力，以念穹蒼。
en: Heaven is sending down death and disorder, And ​has put an end to our king. It is (now) sending down those devourers of the grain, So that the husbandry is all in evil case. Alas for our middle states! All is in peril and going to ruin. I have no strength (to do anything), And think of (the Power in) the azure vault.

source: 倬彼雲漢，昭回于天。王曰於乎，何辜今之人？天降喪亂，饑饉薦臻。 靡神不舉，靡愛斯牲。圭璧既卒，寧莫我聽。
en: Bright was the milky way, Shining and revolving in the sky. The king said, 'Oh! What crime is chargeable on us now, That Heaven (thus) sends down death and disorder? Famine comes again and again. There is no spirit I have not sacrificed to; There is no victim I have grudged; Our ​jade symbols, oblong and round, are exhausted;— How is it that I am not heard?

source: 旱既大甚，蘊隆蟲蟲。不殄禋祀，自郊徂宮。上下奠瘞，靡神不宗。 后稷不克，上帝不臨。耗斁下土，寧丁我躬。
en: 'The drought is excessive; Its fervours become more and more tormenting. I have not ceased offering pure sacrifices; From the border altars I have gone to the ancestral temple. To the (Powers) above and below I have presented my offerings and then buried them;— There is no spirit whom I have not honoured. Hâu-kî is not equal to the occasion; God does not come to us. This wasting and ruin of our country,— Would that it fell (only) on me!

source: 旱既大甚，則不可推。兢兢業業，如霆如雷。周餘黎民，靡有孑遺。 昊天上帝，則不我遺。胡不相畏？先祖于摧。
en: 'The drought is excessive, And I may not try to excuse myself. I am full of terror, and feel the peril, Like the clap of thunder or the roll. Of the remnant of Kâu, among the black-haired people, There will not be half a man left; Nor will God from his great heaven exempt (even) me. Shall ​we not mingle our fears together? (The sacrifices to) my ancestors will be extinguished.

source: 旱既大甚，則不可沮。赫赫炎炎，云我無所。大命近止，靡瞻靡顧。 羣公先正，則不我助。父母先祖，胡寧忍予？
en: 'The drought is excessive, And it cannot be stopped. More fierce and fiery, It is leaving me no place. My end is near;— I have none to look up, none to look round, to. The many dukes and their ministers of the past Give me no help. O ye parents and (nearer) ancestors, How can ye bear to see me thus?

source: 旱既大甚，滌滌山川。旱魃為虐，如惔如焚。我心憚暑，憂心如薰。 羣公先正，則不我聞。昊天上帝，寧俾我遯？
en: 'The drought is excessive;— Parched are the hills, and the streams are dried. The demon of drought exercises his oppression, As if scattering flames and fire My heart is terrified with the heat;— My sorrowing heart is as if on fire. The ​many dukes and their ministers of the past Do not hear me. O God, from thy great heaven, Grant me the liberty to withdraw (into retirement).

source: 旱既大甚，黽勉畏去。胡寧瘨我以旱？憯不知其故。祈年孔夙，方社不莫。 昊天上帝，則不我虞。敬恭明神，宜無悔怒。
en: 'The drought is excessive;— I struggle and fear to go away. How is it that I am afflicted with this drought? I cannot ascertain the cause of it. In praying for a good year I was abundantly early. I was not late (in sacrificing) to (the spirits of) the four quarters and of the land. God in great heaven Does not consider me. Reverent to the intelligent spirits, I ought not to be thus the object of their anger.

source: 旱既大甚，散無友紀。鞫哉庶正，疚哉冢宰。趣馬師氏，膳夫左右。 靡人不周，無不能止。瞻卬昊天，云如何里？
en: 'The drought is excessive;— All is dispersion, and the bonds of government are relaxed. Reduced to extremities are the heads of departments; Full of distress are my chief ministers, The Master of the Horse, the Commander of the Guards, The chief Cook, and my attendants. There is no one who has not (tried to) help (the people); They have not refrained on the ground of being unable. I look up to the great heaven;— Why am I plunged in this sorrow?

source: 瞻卬昊天，有嘒其星。大夫君子，昭假無贏。大命近止，無棄爾成。 何求為我？以戾庶正。瞻卬昊天，曷惠其寧？
en: 'I look up to the great heaven, But its stars sparkle bright. My great officers and excellent men, Ye have reverently drawn near (to Heaven) with all ​your powers. Death is approaching, But do not cast away what you have done. You are seeking not for me only, But to give rest to all our departments. I look up to the great heaven;— When shall I be favoured with repose?'

source: 崧高維嶽，駿極于天。維嶽降神，生甫及申。 維申及甫，維周之翰。四國于蕃，四方于宣。
en: Grandly lofty are the mountains, With their large masses reaching to the heavens. From those mountains was sent down a spirit, Who produced the birth of (the princes of) Fû and Shăn. Fû and ​Shăn Are the support of Kâu, Screens to all the states, Diffusing (their influence) over the four quarters of the kingdom.

source: 亹亹申伯，王纘之事。于邑于謝，南國是式。 王命召伯，定申伯之宅。登是南邦，世執其功。
en: Full of activity is the chief of Shăn, And the king would employ him to continue the services (of his fathers), With his capital in Hsieh, Where he should be a pattern to the states of the south. The king gave charge to the earl of Shâo, To arrange all about the residence of the chief of Shăn, Where he should do what was necessary for the regions of the south, And where his posterity might maintain his merit.

source: 申伯之功，召伯是營。有俶其城，寢廟既成。 既成藐藐，王錫申伯。四牡蹻蹻，鉤膺濯濯。
en: Of the services of the chief of Shăn The foundation was laid by the earl of Shâo, Who first built the walls (of his city), And then completed his ancestral temple. When the temple was completed, wide and grand, The king conferred on the chief of Shâo Four noble steeds, With the hooks for the trappings of the breast-bands, glittering bright.

source: 天生烝民，有物有則。民之秉彝，好是懿德。 天監有周，昭假于下。保茲天子，生仲山甫。
en: Heaven, in giving birth to the multitudes of the people, To every faculty and relationship annexed its law. The people possess this normal nature, And they (consequently) love its normal virtue. Heaven beheld the ruler of Kâu, Brilliantly affecting it by his conduct below, And to maintain him, its Son, Gave birth to Kung Shan-fû.

source: 仲山甫出祖，四牡業業，征夫捷捷。 每懷靡及，四牡彭彭，八鸞鏘鏘。王命仲山甫，城彼東方。
en: Kung Shan-fû went forth, having sacrificed to the spirit of the road. His four steeds were strong; ​His men were alert, He was always anxious lest he should not be equal to his commission; His steeds went on without stopping, To the tinkling of their eight bells. The king had given charge to Kung Shan-fû, To fortify the city there in the east.

source: 奕奕梁山，維禹甸之。有倬其道，韓侯受命。 王親命之，纘戎祖考，無廢朕命，夙夜匪解，虔共爾位。 朕命不易，榦不庭方，以佐戎辟。
en: Very grand is the mountain of Liang, Which was made cultivable by Yü. Bright is the way from it, (Along which came) the marquis of Han to receive investiture. The king in person gave the charge:— 'Continue the services of your ancestors; Let not my charge to you come to nought. Be diligent early and late, And reverently discharge your duties:— So shall my appointment of you not change. Be a support against those princes who do not come to court, Thus assisting your sovereign.' When the marquis of Han left the court, he sacrificed to the spirit of the road. He went forth, and lodged for the night in Tû.

source: 王命召虎，來旬來宣。文武受命，召公維翰。 無曰予小子，召公是似。肇敏戎公，用錫爾祉。
en: The king gave charge to Hû of Shâo:— 'You have everywhere made known (and carried out my orders). When (the kings) Wăn and Wû received their appointment, The duke of Shâo was their strong support. You not (only) have a regard to me the little child But you try to resemble that duke of Shâo. You have commenced and earnestly displayed your merit; And I will make you happy.

source: 釐爾圭瓚，秬鬯一卣，告于文人。 錫山土田，于周受命，自召祖命。 虎拜稽首，天子萬年。
en: 'I give you a large libation-cup of jade, And a jar of herb-flavoured spirits from the black millet. I have made announcement to the Accomplished one, And confer on you hills, lands, and fields. In (Khî-)kâu shall you receive investiture, According as your ancestor received his.' Hû bowed with ​his head to the ground (and said), 'May the Son of Heaven live for ever!'

source: 瞻卬昊天，則不我惠。孔填不寧，降此大厲。 邦靡有定，士民其瘵。 蟊賊蟊疾，靡有夷屆。罪罟不收，靡有夷瘳。
en: I look up to great Heaven, But it shows us no kindness. Very long have we been disquieted, And these great calamities are sent down (upon us). There is nothing settled in the country; Officers and people are in distress. Through the insects from without and from within, There is no peace or limit (to our misery). The net of crime is not taken up, And there is no peace nor cure (for our state).

source: 天何以刺？何神不富？舍爾介狄，維予胥忌。 不弔不祥，威儀不類。人之云亡，邦國殄瘁。
en: Why is it that Heaven is (thus) reproving (you)? Why is it that Heaven is not blessing (you)? You neglect your great barbarian (foes), And regard me with hatred. You are regardless of the evil omens (that abound), And your demeanour is all unseemly. (Good) men are going away, And the country is sure to go to ruin.

source: 天之降罔，維其優矣。人之云亡，心之憂矣。 天之降罔，維其幾矣。人之云亡，心之悲矣。
en: Heaven is letting down its net, And many (are the calamities in it). (Good) men are going away, And my heart is sorrowful. Heaven is letting down ​its net, And soon (all will be caught in it). (Good) men are going away, And my heart is sad.

source: 觱沸檻泉，維其深矣。心之憂矣，寧自今矣。 不自我先，不自我後。藐藐昊天，無不克鞏。 無忝皇祖，式救爾後。
en: Right from the spring comes the water bubbling, Revealing its depth. The sorrow of my heart,— Is it (only) of to-day? Why were these things not before me? Or why were they not after me? But mysteriously great Heaven Is able to strengthen anything. Do not disgrace your great ancestors:— This will save your posterity.

source: 旻天疾威，天篤降喪。 瘨我饑饉，民卒流亡。我居圉卒荒。 天降罪罟，蟊賊內訌。 昏椓靡共，潰潰回遹。實靖夷我邦。 皐皐訿訿，曾不知其玷。 兢兢業業，孔填不寧。我位孔貶。 如彼歲旱，草不潰茂。 如彼棲苴。我相此邦，無不潰止。 維昔之富，不如時？維今之疚，不如茲？ 彼疏斯粺，胡不自替？職兄斯引。 池之竭矣，不云自頻？泉之竭矣，不云自中？ 溥斯害矣，職兄斯弘，不烖我躬？ 昔先王受命，有如召公，日辟國百里，今也日蹙國百里。 於乎哀哉，維今之人，不尚有舊。
en: Compassionate Heaven is arrayed in angry terrors. Heaven is indeed sending down ruin, Afflicting us with famine, So that the people are all wandering fugitives. In the settled regions, and on the borders, all is desolation. Heaven sends down its net of crime;— Devouring insects, who weary and confuse men's minds, Ignorant, oppressive, negligent, Breeders of confusion, utterly perverse:— These are the men employed.

source: 於穆清廟，肅雝顯相。 濟濟多士，秉文之德。 對越在天，駿奔走在廟。 不顯不承，無射於人斯。
en: Oh! solemn is the ancestral temple in its pure stillness. Reverent and harmonious were the distinguished assistants; Great was the number of the officers:— (All) assiduous followers of the virtue of (king Wăn). In response to him in heaven, Grandly they hurried about in the temple. Distinguished is he and honoured, And will never be wearied of among men.
